app/controllers/scores_controller.rb

  def index
    @scores = Score.order("score DESC").limit(10)
---
SELECT  "scores".* FROM "scores"   ORDER BY score DESC LIMIT 10

  def create
    @score = Score.new(score_params)
    @score.save
    # head :ok
    @scores = Score.order("score DESC").limit(10)
---
INSERT INTO "scores" ("created_at", "name", "score", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-31 18:47:42.932819"], ["name", "Ari"], ["score", 8323], ["updated_at", "2014-07-31 18:47:42.932819"]]
SELECT  "scores".* FROM "scores"   ORDER BY score DESC LIMIT 10